glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_interlock_dsl.c
// ============================================================================
// samd21_interlock_dsl.c — recursive-descent parser for the interlock DSL.
//
// Grammar (slice 2 — gpio_int subset, locked in design memo
// samd21_interlock_framework_design.md):
//
//   msg       := name (";" section)*
//   section   := keyword "[" content "]"
//   content   := item ("," item)*
//   item      := key (":" value)? | pin_tuple ":" mod_list
//   key       := ident
//   pin_tuple := "(" ident ("," ident)* ")"
//   value     := ident | number
//   mod_list  := ident ("," ident)*
//
//   keywords v1: cfg, watch, out_ok, out_err
//   modes:       in (optional pull modifier: up, down), out
//
// Slice 2 specifically refuses keywords/modes outside this set so the
// parser's failure modes are deterministic. Slice 4 adds ADC modifiers
// (oversample_N, sh_N). Slice 6 adds hyst_N (ADC dead-band), debounce_N
// (GPIO shift-register filter), and underscore-prefix virtual inputs
// (_t_since_m2s / _uptime / _stack_hwm) auto-declared on first watch ref.
//
// No heap usage. Caller-supplied il_inst_t is populated in place; on parse
// failure the caller MUST discard *out (left in undefined state).
// ============================================================================

#include "samd21_interlocks.h"
#include "samd21_pin_table.h"
#include "samd21_hal_pin.h"
#include <string.h>
#include <stdbool.h>

// ---------------------------------------------------------------------------
// Parser state
// ---------------------------------------------------------------------------

typedef struct {
    const char* text;
    uint16_t    len;
    uint16_t    pos;
    bool        adc_mode;   // watch operands are ADC streams (auto-declared inputs)
} parser_t;

static bool at_end(const parser_t* p) {
    return p->pos >= p->len;
}

static char peek(const parser_t* p) {
    return at_end(p) ? '\0' : p->text[p->pos];
}

static void skip_ws(parser_t* p) {
    while (!at_end(p)) {
        char c = p->text[p->pos];
        if (c == ' ' || c == '\t' || c == '\r' || c == '\n') p->pos++;
        else break;
    }
}

static bool is_ident_start(char c) {
    return (c >= 'a' && c <= 'z')
        || (c >= 'A' && c <= 'Z')
        || c == '_';
}

static bool is_ident_cont(char c) {
    return is_ident_start(c) || (c >= '0' && c <= '9');
}

static bool is_digit(char c) {
    return c >= '0' && c <= '9';
}

// Reads an identifier starting at p->pos. Returns 0 if not at an ident start.
// On success, *start = ident first char, *len = length, advances p->pos.
static bool read_ident(parser_t* p, const char** start, uint8_t* len) {
    skip_ws(p);
    if (at_end(p) || !is_ident_start(p->text[p->pos])) return false;
    *start = &p->text[p->pos];
    uint16_t begin = p->pos;
    while (!at_end(p) && is_ident_cont(p->text[p->pos])) p->pos++;
    *len = (uint8_t)(p->pos - begin);
    return true;
}

// Reads a decimal or hex number. *out = value (truncated to u16).
static bool read_number(parser_t* p, uint16_t* out) {
    skip_ws(p);
    if (at_end(p)) return false;
    uint32_t val = 0;
    bool any = false;
    if (p->pos + 1 < p->len
        && p->text[p->pos] == '0'
        && (p->text[p->pos + 1] == 'x' || p->text[p->pos + 1] == 'X')) {
        p->pos += 2;
        while (!at_end(p)) {
            char c = p->text[p->pos];
            uint8_t d = 0;
            if (c >= '0' && c <= '9') d = (uint8_t)(c - '0');
            else if (c >= 'a' && c <= 'f') d = (uint8_t)(c - 'a' + 10);
            else if (c >= 'A' && c <= 'F') d = (uint8_t)(c - 'A' + 10);
            else break;
            val = (val << 4) | d;
            p->pos++;
            any = true;
        }
    } else {
        while (!at_end(p) && is_digit(p->text[p->pos])) {
            val = val * 10u + (uint32_t)(p->text[p->pos] - '0');
            p->pos++;
            any = true;
        }
    }
    if (!any) return false;
    *out = (uint16_t)val;
    return true;
}

static bool consume_char(parser_t* p, char want) {
    skip_ws(p);
    if (at_end(p) || p->text[p->pos] != want) return false;
    p->pos++;
    return true;
}

static bool ident_equals(const char* s, uint8_t len, const char* lit) {
    if (strlen(lit) != len) return false;
    return memcmp(s, lit, len) == 0;
}

// True if `s[0..len)` is a parameterised modifier of the form `<prefix><digits>`
// where prefix matches `lit_prefix` (with its trailing underscore) and the
// remainder is one or more digits. e.g. is_param_mod("oversample_16",13,"oversample_") → true.
static bool is_param_mod(const char* s, uint8_t len, const char* lit_prefix) {
    size_t plen = strlen(lit_prefix);
    if (len <= plen) return false;
    if (memcmp(s, lit_prefix, plen) != 0) return false;
    for (uint8_t i = (uint8_t)plen; i < len; i++) {
        if (s[i] < '0' || s[i] > '9') return false;
    }
    return true;
}

// Parse the trailing digits of an `<prefix>N` token into a u16. Caller must
// have already verified the token shape via is_param_mod. Returns false on
// overflow past u16.
static bool parse_param_mod_value(const char* s, uint8_t len, const char* lit_prefix,
                                  uint16_t* out) {
    size_t plen = strlen(lit_prefix);
    uint32_t v = 0;
    for (uint8_t i = (uint8_t)plen; i < len; i++) {
        v = v * 10u + (uint32_t)(s[i] - '0');
        if (v > 65535u) return false;
    }
    *out = (uint16_t)v;
    return true;
}

// True for any modifier the parser recognises (used by the lookahead that
// decides whether a comma starts a new group or continues the modifier list).
static bool is_known_modifier(const char* s, uint8_t len) {
    if (ident_equals(s, len, "in"))   return true;
    if (ident_equals(s, len, "out"))  return true;
    if (ident_equals(s, len, "adc"))  return true;
    if (ident_equals(s, len, "up"))   return true;
    if (ident_equals(s, len, "down")) return true;
    if (is_param_mod(s, len, "oversample_")) return true;
    if (is_param_mod(s, len, "sh_"))         return true;
    if (is_param_mod(s, len, "hyst_"))       return true;
    if (is_param_mod(s, len, "debounce_"))   return true;
    return false;
}

