glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_interlock_dsl.c
// ---- Virtual input table (slice 6) ---------------------------------------
// Synthesized signals readable via the DSL. Labels begin with '_' to keep
// them disjoint from board pin labels (D0..D10/A0..A10). Watched implicitly:
// referencing one in watch[] auto-declares an input with mode=VIRTUAL.
typedef struct { const char* name; uint8_t virt_id; } il_virt_pin_t;
static const il_virt_pin_t k_virt_pins[] = {
    { "_t_since_m2s", IL_VIRT_T_SINCE_M2S },
    { "_uptime",      IL_VIRT_UPTIME      },
    { "_stack_hwm",   IL_VIRT_STACK_HWM   },
};
static const uint8_t k_virt_pin_count = sizeof(k_virt_pins) / sizeof(k_virt_pins[0]);

// Returns 0..0xEF mapped virt_id on match, or 0xFF if `s` is not a known
// virtual name. Caller signals "this isn't a virtual" via len[0] != '_'.
static uint8_t virt_lookup(const char* s, uint8_t len) {
    for (uint8_t i = 0; i < k_virt_pin_count; i++) {
        if (ident_equals(s, len, k_virt_pins[i].name)) return k_virt_pins[i].virt_id;
    }
    return 0xFFu;
}

// Map a SAMPLENUM count (1,2,4,8,16) to its exponent (0..4). Returns 0xFF on invalid.
static uint8_t samplenum_to_exp(uint16_t n) {
    switch (n) {
        case 1:  return 0;
        case 2:  return 1;
        case 4:  return 2;
        case 8:  return 3;
        case 16: return 4;
        default: return 0xFFu;
    }
}

// ---------------------------------------------------------------------------
// Section parsers
// ---------------------------------------------------------------------------

// Locate the il_inst input index for an already-declared pin label.
static int find_input_idx(const il_inst_t* inst, uint8_t phys_id) {
    for (uint8_t i = 0; i < inst->input_count; i++) {
        if (inst->inputs[i].phys_id == phys_id) return (int)i;
    }
    return -1;
}

static int find_output_idx(const il_inst_t* inst, uint8_t phys_id) {
    for (uint8_t i = 0; i < inst->output_count; i++) {
        if (inst->outputs[i].phys_id == phys_id) return (int)i;
    }
    return -1;
}

// cfg[(D1,D2):in,up,(D3):out]  --or--  cfg[D1:in]
// Slice 4 adds: cfg[(A1):adc,oversample_16,sh_8]
// Allows multiple groups separated by commas.
static il_parse_status_t parse_cfg(parser_t* p, il_inst_t* inst) {
    while (true) {
        // Parse pin list: either single ident or "(" ident ("," ident)* ")"
        const char* pin_labels[IL_MAX_INPUTS + IL_MAX_OUTPUTS];
        uint8_t     pin_lens  [IL_MAX_INPUTS + IL_MAX_OUTPUTS];
        uint8_t     n_pins = 0;

        skip_ws(p);
        if (consume_char(p, '(')) {
            while (true) {
                if (n_pins >= IL_MAX_INPUTS + IL_MAX_OUTPUTS) return IL_PARSE_TOO_MANY_INPUTS;
                if (!read_ident(p, &pin_labels[n_pins], &pin_lens[n_pins])) return IL_PARSE_UNEXPECTED_CHAR;
                n_pins++;
                if (consume_char(p, ',')) continue;
                if (!consume_char(p, ')')) return IL_PARSE_UNEXPECTED_CHAR;
                break;
            }
        } else {
            if (!read_ident(p, &pin_labels[0], &pin_lens[0])) return IL_PARSE_UNEXPECTED_CHAR;
            n_pins = 1;
        }
        if (!consume_char(p, ':')) return IL_PARSE_UNEXPECTED_CHAR;

        // Parse mode + optional modifiers. The "list" can hold up to 4 entries:
        // mode + up to 3 qualifiers (e.g. adc + oversample_N + sh_N).
        const char* mod_strs[4];
        uint8_t     mod_lens[4];
        uint8_t     mod_count = 0;
        while (true) {
            if (mod_count >= 4) return IL_PARSE_UNKNOWN_MODE;
            if (!read_ident(p, &mod_strs[mod_count], &mod_lens[mod_count])) return IL_PARSE_UNEXPECTED_CHAR;
            mod_count++;
            // A comma continues THIS group's mod-list only when it is followed by
            // a known modifier. A comma before '(' or a bare pin label is a GROUP
            // separator and must be left for the outer loop — so remember where the
            // comma was and give it back in those cases (else multi-group cfg, e.g.
            // "(A0):adc,(D8):in", loses the separator and fails as UNEXPECTED_CHAR).
            uint16_t pre_comma = p->pos;
            if (!consume_char(p, ',')) break;
            skip_ws(p);
            if (peek(p) == '(')              { p->pos = pre_comma; break; }
            if (!is_ident_start(peek(p)))    { p->pos = pre_comma; break; }
            uint16_t at_ident = p->pos;
            const char* ns; uint8_t nl;
            if (!read_ident(p, &ns, &nl)) return IL_PARSE_UNEXPECTED_CHAR;
            bool is_mod = is_known_modifier(ns, nl);
            if (!is_mod) { p->pos = pre_comma; break; }   // next group's bare pin
            p->pos = at_ident;                            // re-read as this group's modifier
        }

        // Resolve mode from first modifier; rest are qualifiers (pull / adc cfg).
        il_pin_mode_t mode;
        bool is_input = false;
        bool is_adc   = false;
        if      (ident_equals(mod_strs[0], mod_lens[0], "in"))  { mode = IL_PIN_MODE_IN;  is_input = true;  }
        else if (ident_equals(mod_strs[0], mod_lens[0], "out")) { mode = IL_PIN_MODE_OUT; is_input = false; }
        else if (ident_equals(mod_strs[0], mod_lens[0], "adc")) { mode = IL_PIN_MODE_ADC; is_input = true; is_adc = true; }
        else return IL_PARSE_UNKNOWN_MODE;

        // ADC default config: 1 sample (exp=0), 4 sample-hold cycles. Matches
        // the bench-validated values in samd21_commands.c adc_init.
        uint8_t  adc_oversample_exp = 0;
        uint8_t  adc_sh_cyc         = 4;
        uint16_t hyst_val           = 0;   // slice 6: ADC-only
        uint8_t  debounce_depth     = 0;   // slice 6: GPIO-only

        for (uint8_t i = 1; i < mod_count; i++) {
            const char* ms = mod_strs[i];
            uint8_t     ml = mod_lens[i];

            if (is_adc) {
                if (is_param_mod(ms, ml, "oversample_")) {
                    uint16_t n;
                    if (!parse_param_mod_value(ms, ml, "oversample_", &n))
                        return IL_PARSE_OVERSAMPLE_OUT_OF_RANGE;
                    uint8_t exp = samplenum_to_exp(n);
                    if (exp == 0xFFu) return IL_PARSE_OVERSAMPLE_OUT_OF_RANGE;
                    adc_oversample_exp = exp;
                } else if (is_param_mod(ms, ml, "sh_")) {
                    uint16_t n;
                    if (!parse_param_mod_value(ms, ml, "sh_", &n))
                        return IL_PARSE_SH_OUT_OF_RANGE;
                    if (n > 63u) return IL_PARSE_SH_OUT_OF_RANGE;
                    adc_sh_cyc = (uint8_t)n;
                } else if (is_param_mod(ms, ml, "hyst_")) {
                    if (!parse_param_mod_value(ms, ml, "hyst_", &hyst_val))
                        return IL_PARSE_THRESHOLD_OUT_OF_RANGE;
                } else if (is_param_mod(ms, ml, "debounce_")) {
                    return IL_PARSE_DEBOUNCE_NOT_ON_GPIO;
                } else {
                    return IL_PARSE_UNKNOWN_MODE;
                }
            } else if (is_input) {
                if      (ident_equals(ms, ml, "up"))   mode = IL_PIN_MODE_IN_PU;
                else if (ident_equals(ms, ml, "down")) mode = IL_PIN_MODE_IN_PD;
                else if (is_param_mod(ms, ml, "debounce_")) {
                    uint16_t n;
                    if (!parse_param_mod_value(ms, ml, "debounce_", &n))
                        return IL_PARSE_DEBOUNCE_OUT_OF_RANGE;
                    if (n < 2u || n > 15u) return IL_PARSE_DEBOUNCE_OUT_OF_RANGE;
                    debounce_depth = (uint8_t)n;
                }
                else if (is_param_mod(ms, ml, "hyst_"))
                    return IL_PARSE_HYST_NOT_ON_ADC;
                else if (is_param_mod(ms, ml, "oversample_") || is_param_mod(ms, ml, "sh_"))
                    return IL_PARSE_MODIFIER_ON_GPIO;
                else return IL_PARSE_UNKNOWN_MODE;
            } else {
                // out doesn't take any modifiers
                if (is_param_mod(ms, ml, "hyst_"))     return IL_PARSE_HYST_NOT_ON_ADC;
                if (is_param_mod(ms, ml, "debounce_")) return IL_PARSE_DEBOUNCE_NOT_ON_GPIO;
                if (is_param_mod(ms, ml, "oversample_") || is_param_mod(ms, ml, "sh_"))
                    return IL_PARSE_MODIFIER_ON_GPIO;
                return IL_PARSE_UNKNOWN_MODE;
            }
        }

        // Record each pin in inst->inputs or inst->outputs.
        for (uint8_t i = 0; i < n_pins; i++) {
            const board_pin_t* bp = board_pin_lookup(pin_labels[i], pin_lens[i]);
            if (bp == 0) return IL_PARSE_UNKNOWN_PIN;
            uint8_t phys_id = board_pin_phys_id(bp);

            if (is_input) {
                if (find_input_idx(inst, phys_id) >= 0)  return IL_PARSE_DUPLICATE_PIN;
                if (find_output_idx(inst, phys_id) >= 0) return IL_PARSE_DUPLICATE_PIN;
                if (inst->input_count >= IL_MAX_INPUTS)  return IL_PARSE_TOO_MANY_INPUTS;
                inst->inputs[inst->input_count].phys_id        = phys_id;
                inst->inputs[inst->input_count].mode           = (uint8_t)mode;
                inst->inputs[inst->input_count].oversample_exp = is_adc ? adc_oversample_exp : 0;
                inst->inputs[inst->input_count].sh_cyc         = is_adc ? adc_sh_cyc         : 0;
                inst->inputs[inst->input_count].debounce_depth = is_adc ? 0 : debounce_depth;
                inst->inputs[inst->input_count].reserved       = 0;
                inst->inputs[inst->input_count].hyst           = is_adc ? hyst_val : 0;
                inst->input_count++;
            } else {
                if (find_input_idx(inst, phys_id)  >= 0) return IL_PARSE_DUPLICATE_PIN;
                if (find_output_idx(inst, phys_id) >= 0) return IL_PARSE_DUPLICATE_PIN;
                if (inst->output_count >= IL_MAX_OUTPUTS) return IL_PARSE_TOO_MANY_OUTPUTS;
                inst->outputs[inst->output_count].phys_id   = phys_id;
                inst->outputs[inst->output_count].ok_value  = 0;   // populated by out_ok
                inst->outputs[inst->output_count].err_value = 0;
                inst->output_count++;
            }
        }

        // Continue to next group?
        if (!consume_char(p, ',')) break;
    }
    return IL_PARSE_OK;
}

// Resolve an ADC-mode watch operand: "A1" (instantaneous) or "A1_avg_fast"
// (stat_window) -> auto-declared IL_PIN_MODE_ADC_STREAM input. phys_id = the
// pin's AIN; oversample_exp = stat (0 now/1 avg/2 min/3 max/4 rms); sh_cyc =
// window (0 fast/1 mid/2 slow). No cfg claim -- the ADC sweep samples all chans.
static il_parse_status_t resolve_adc_stream(il_inst_t* inst, const char* s,
                                            uint8_t len, int* out_idx) {
    uint8_t u1 = len;
    for (uint8_t i = 0; i < len; i++) if (s[i] == '_') { u1 = i; break; }
    const board_pin_t* bp = board_pin_lookup(s, u1);
    if (bp == 0) return IL_PARSE_UNKNOWN_PIN;
    uint8_t ain = bp->adc_channel, stat = 0u, win = 0u;     // default: instantaneous
    if (u1 < len) {
        uint8_t u2 = len;
        for (uint8_t i = (uint8_t)(u1 + 1); i < len; i++) if (s[i] == '_') { u2 = i; break; }
        if (u2 >= len) return IL_PARSE_UNEXPECTED_CHAR;
        const char* ss = s + u1 + 1; uint8_t sl = (uint8_t)(u2 - u1 - 1);
        const char* ws = s + u2 + 1; uint8_t wl = (uint8_t)(len - u2 - 1);
        if      (ident_equals(ss, sl, "avg")) stat = 1u;
        else if (ident_equals(ss, sl, "min")) stat = 2u;
        else if (ident_equals(ss, sl, "max")) stat = 3u;
        else if (ident_equals(ss, sl, "rms")) stat = 4u;
        else return IL_PARSE_UNKNOWN_MODE;
        if      (ident_equals(ws, wl, "fast")) win = 0u;
        else if (ident_equals(ws, wl, "mid"))  win = 1u;
        else if (ident_equals(ws, wl, "slow")) win = 2u;
        else return IL_PARSE_UNKNOWN_MODE;
    }
    for (uint8_t i = 0; i < inst->input_count; i++) {       // dedup (ain,stat,win)
        il_input_t* in = &inst->inputs[i];
        if (in->mode == (uint8_t)IL_PIN_MODE_ADC_STREAM &&
            in->phys_id == ain && in->oversample_exp == stat && in->sh_cyc == win) {
            *out_idx = (int)i; return IL_PARSE_OK;
        }
    }
    if (inst->input_count >= IL_MAX_INPUTS) return IL_PARSE_TOO_MANY_INPUTS;
    il_input_t* in = &inst->inputs[inst->input_count];
    in->phys_id = ain; in->mode = (uint8_t)IL_PIN_MODE_ADC_STREAM;
    in->oversample_exp = stat; in->sh_cyc = win;
    in->debounce_depth = 0u; in->reserved = 0u; in->hyst = 0u;
    *out_idx = (int)inst->input_count;
    inst->input_count++;
    return IL_PARSE_OK;
}

// watch[D1:1,D2:1]                    — slice-2 implicit-eq form (still legal)
// watch[A1:gt:512,A1:lt:3000]         — slice-4 3-part form: pin:op:threshold
// watch[_t_since_m2s:gt:30]           — slice-6 virtual input; auto-declared
// watch[A1:gt:512,D8:1 | D9:0]        — slice-7 DNF: `,` ANDs within a group,
//                                       `|` starts a new group; groups are ORed
//   op ∈ {eq, ne, lt, gt, le, ge}
static il_parse_status_t parse_watch(parser_t* p, il_inst_t* inst) {
    uint8_t cur_group = 0;   // slice 7: which DNF OR-group the next clause joins
    while (true) {
        const char* lbl; uint8_t llen;
        if (!read_ident(p, &lbl, &llen)) return IL_PARSE_UNEXPECTED_CHAR;
        if (!consume_char(p, ':')) return IL_PARSE_UNEXPECTED_CHAR;

        // Disambiguate 2-part vs 3-part by peeking the next non-whitespace char.
        // alpha → op token (3-part form); digit → value (2-part implicit-eq).
        skip_ws(p);
        il_compare_op_t op = IL_OP_EQ;
        if (is_ident_start(peek(p))) {
            const char* opstr; uint8_t oplen;
            if (!read_ident(p, &opstr, &oplen)) return IL_PARSE_UNEXPECTED_CHAR;
            if      (ident_equals(opstr, oplen, "eq")) op = IL_OP_EQ;
            else if (ident_equals(opstr, oplen, "ne")) op = IL_OP_NE;
            else if (ident_equals(opstr, oplen, "lt")) op = IL_OP_LT;
            else if (ident_equals(opstr, oplen, "gt")) op = IL_OP_GT;
            else if (ident_equals(opstr, oplen, "le")) op = IL_OP_LE;
            else if (ident_equals(opstr, oplen, "ge")) op = IL_OP_GE;
            else return IL_PARSE_UNKNOWN_OP;
            if (!consume_char(p, ':')) return IL_PARSE_UNEXPECTED_CHAR;
        }
        uint16_t val;
        if (!read_number(p, &val)) return IL_PARSE_BAD_NUMBER;

