glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_interlock_dsl.c
        uint8_t phys_id;
        int     idx;
        if (p->adc_mode) {
            // ADC mode: operand is an ADC stream (auto-declared), not a cfg pin.
            il_parse_status_t rs = resolve_adc_stream(inst, lbl, llen, &idx);
            if (rs != IL_PARSE_OK) return rs;
        } else if (lbl[0] == '_') {
            // Virtual input — resolve to virt_id and auto-declare if first ref.
            uint8_t virt_id = virt_lookup(lbl, llen);
            if (virt_id == 0xFFu) return IL_PARSE_UNKNOWN_VIRTUAL;
            phys_id = virt_id;
            idx = find_input_idx(inst, phys_id);
            if (idx < 0) {
                if (inst->input_count >= IL_MAX_INPUTS) return IL_PARSE_TOO_MANY_INPUTS;
                inst->inputs[inst->input_count].phys_id        = phys_id;
                inst->inputs[inst->input_count].mode           = (uint8_t)IL_PIN_MODE_VIRTUAL;
                inst->inputs[inst->input_count].oversample_exp = 0;
                inst->inputs[inst->input_count].sh_cyc         = 0;
                inst->inputs[inst->input_count].debounce_depth = 0;
                inst->inputs[inst->input_count].reserved       = 0;
                inst->inputs[inst->input_count].hyst           = 0;
                idx = (int)inst->input_count;
                inst->input_count++;
            }
        } else {
            const board_pin_t* bp = board_pin_lookup(lbl, llen);
            if (bp == 0) return IL_PARSE_UNKNOWN_PIN;
            phys_id = board_pin_phys_id(bp);
            idx = find_input_idx(inst, phys_id);
            if (idx < 0) return IL_PARSE_WATCH_INPUT_UNDECL;
        }

        // Hysteresis is a directional dead-band — only meaningful for ordered
        // comparisons. eq/ne lack a "side" so we reject the combination
        // explicitly rather than silently ignoring the hyst field.
        if (inst->inputs[idx].hyst != 0u
            && (op == IL_OP_EQ || op == IL_OP_NE)) {
            return IL_PARSE_HYST_ON_EQ_NE;
        }

        if (inst->watch_count >= IL_MAX_WATCHES) return IL_PARSE_TOO_MANY_WATCHES;
        inst->watches[inst->watch_count].input_idx = (uint8_t)idx;
        inst->watches[inst->watch_count].op        = (uint8_t)op;
        inst->watches[inst->watch_count].threshold = val;
        inst->watches[inst->watch_count].group     = cur_group;
        inst->watch_count++;

        // Separator: ',' = another clause in the SAME group (AND); '|' = start a
        // new group (OR). Anything else ends the watch list.
        if (consume_char(p, ',')) continue;
        if (consume_char(p, '|')) { cur_group++; continue; }
        break;
    }
    return IL_PARSE_OK;
}

// out_ok[D3:0]  or  out_err[D3:1]
// is_ok = true → write into ok_value; false → err_value.
static il_parse_status_t parse_out_block(parser_t* p, il_inst_t* inst, bool is_ok) {
    while (true) {
        const char* lbl; uint8_t llen;
        if (!read_ident(p, &lbl, &llen)) return IL_PARSE_UNEXPECTED_CHAR;
        if (!consume_char(p, ':')) return IL_PARSE_UNEXPECTED_CHAR;
        uint16_t val;
        if (!read_number(p, &val)) return IL_PARSE_BAD_NUMBER;
        if (val > 1u) return IL_PARSE_BAD_NUMBER;   // GPIO-only for slice 2

        const board_pin_t* bp = board_pin_lookup(lbl, llen);
        if (bp == 0) return IL_PARSE_UNKNOWN_PIN;
        uint8_t phys_id = board_pin_phys_id(bp);
        int idx = find_output_idx(inst, phys_id);
        if (idx < 0) return IL_PARSE_OUTPUT_UNDECL;

        if (is_ok) inst->outputs[idx].ok_value  = (uint8_t)val;
        else       inst->outputs[idx].err_value = (uint8_t)val;

        if (!consume_char(p, ',')) break;
    }
    return IL_PARSE_OK;
}

// ---------------------------------------------------------------------------
// Top-level driver
// ---------------------------------------------------------------------------

static il_parse_status_t il_parse_impl(const char* text, uint16_t text_len,
                                       il_inst_t* out, uint16_t* err_offset,
                                       bool adc_mode) {
    if (text == 0 || text_len == 0 || out == 0) return IL_PARSE_EMPTY;

    memset(out, 0, sizeof(*out));
    parser_t p = { .text = text, .len = text_len, .pos = 0, .adc_mode = adc_mode };

    // Name
    const char* nstart; uint8_t nlen;
    if (!read_ident(&p, &nstart, &nlen)) {
        if (err_offset) *err_offset = p.pos;
        return IL_PARSE_UNEXPECTED_CHAR;
    }
    if (nlen >= IL_NAME_MAX) {
        if (err_offset) *err_offset = p.pos;
        return IL_PARSE_NAME_TOO_LONG;
    }
    memcpy(out->name, nstart, nlen);
    out->name[nlen] = '\0';

    bool seen_out_ok = false;
    bool seen_out_err = false;

    // Sections
    while (consume_char(&p, ';')) {
        const char* kw; uint8_t klen;
        if (!read_ident(&p, &kw, &klen)) {
            if (err_offset) *err_offset = p.pos;
            return IL_PARSE_UNEXPECTED_CHAR;
        }
        if (!consume_char(&p, '[')) {
            if (err_offset) *err_offset = p.pos;
            return IL_PARSE_UNEXPECTED_CHAR;
        }

        il_parse_status_t st;
        if      (ident_equals(kw, klen, "cfg"))     st = parse_cfg(&p, out);
        else if (ident_equals(kw, klen, "watch"))   st = parse_watch(&p, out);
        else if (ident_equals(kw, klen, "out_ok"))  { st = parse_out_block(&p, out, true);  if (st == IL_PARSE_OK) seen_out_ok = true; }
        else if (ident_equals(kw, klen, "out_err")) { st = parse_out_block(&p, out, false); if (st == IL_PARSE_OK) seen_out_err = true; }
        else {
            if (err_offset) *err_offset = p.pos;
            return IL_PARSE_UNKNOWN_KEYWORD;
        }
        if (st != IL_PARSE_OK) {
            if (err_offset) *err_offset = p.pos;
            return st;
        }

        if (!consume_char(&p, ']')) {
            if (err_offset) *err_offset = p.pos;
            return IL_PARSE_UNEXPECTED_CHAR;
        }
    }

    skip_ws(&p);
    if (!at_end(&p)) {
        if (err_offset) *err_offset = p.pos;
        return IL_PARSE_UNEXPECTED_CHAR;
    }

    if (out->output_count > 0u) {
        if (!seen_out_ok)  return IL_PARSE_MISSING_OUT_OK;
        if (!seen_out_err) return IL_PARSE_MISSING_OUT_ERR;
        // ok and err values must differ on each output pin — otherwise the
        // interlock can't actually communicate state via that pin.
        for (uint8_t i = 0; i < out->output_count; i++) {
            if (out->outputs[i].ok_value == out->outputs[i].err_value) {
                return IL_PARSE_OUTPUT_VALUE_MISMATCH;
            }
        }
    }

    out->tf_state = (uint8_t)IL_TF_UNEVALUATED;
    return IL_PARSE_OK;
}

il_parse_status_t il_parse(const char* text, uint16_t text_len,
                           il_inst_t* out, uint16_t* err_offset) {
    return il_parse_impl(text, text_len, out, err_offset, false);
}

il_parse_status_t il_parse_adc(const char* text, uint16_t text_len,
                               il_inst_t* out, uint16_t* err_offset) {
    return il_parse_impl(text, text_len, out, err_offset, true);
}
